# Пользователь вводит номер буквы в алфавите.
# Определить, какая это буква.
# https://drive.google.com/file/d/1zsyFvwg-FVW8e65kVSbT-1Ew-LIQ181e/view?usp=sharing
a = int(input("Введите номер буквы "))
b = chr(a + 96)
print(f"Под номером {a} находится буква {b}")
